Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.hosts_templatefile will be created
+ resource "local_file" "hosts_templatefile" {
      + content              = <<-EOT
            # This inventory describe a HA typology with stacked etcd (== same nodes as control plane)
            # and 3 worker nodes
            # See https://docs.ansible.com/ansible/latest/inventory_guide/intro_inventory.html
            # for tips on building your # inventory
            
            # Configure 'ip' variable to bind kubernetes services on a different ip than the default iface
            # We should set etcd_member_name for etcd cluster. The node that are not etcd members do not need to set the value,
            # or can set the empty string value.
            
            [all]
            
            [kube_control_plane]
            control-node-subnet-a   ansible_host=158.160.110.213 #fqdn=control-node-subnet-a.ru-central1.internal
            control-node-subnet-b   ansible_host=158.160.9.9 #fqdn=control-node-subnet-b.ru-central1.internal
            control-node-subnet-d   ansible_host=130.193.57.194 #fqdn=control-node-subnet-d.ru-central1.internal
            
            
            
            [etcd:children]
            
            kube_control_plane
            
            
            [kube_node]
            worker-node-1   ansible_host=158.160.36.66 #fqdn=worker-node-1.ru-central1.internal
            worker-node-2   ansible_host=158.160.14.70 #fqdn=worker-node-2.ru-central1.internal
            
            
            [calico_rr]
            
            
            [k8s_cluster:children]
            kube_control_plane
            kube_node
            calico_rr
            
            [kube_control_plane:vars]
            #IP control_node
            supplementary_addresses_in_ssl_keys = [ "158.160.110.213" ]
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/atlantis-data/repos/vakhtanov/netology-diploma-terraform-stage2/11/default/../03_ansible_kubernetes/inventory.ini"
      + id                   = (known after apply)
    }

  # local_file.parameters_templatefile will be created
+ resource "local_file" "parameters_templatefile" {
      + content              = <<-EOT
            {
                "helm_enabled" : true,
                "ingress_nginx_enabled" : true,
                "cluster_name" : "cluster.local",
                "kubectl_localhost" : true,
                "kubeconfig_localhost" : true,
                "persistent_volumes_enabled" : true,
                "dashboard_enabled" : true,
            }
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "/atlantis-data/repos/vakhtanov/netology-diploma-terraform-stage2/11/default/../03_ansible_kubernetes/parameters.json"
      + id                   = (known after apply)
    }

  # yandex_compute_instance.test_vm[0] will be created
+ resource "yandex_compute_instance" "test_vm" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = "test-vm"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = (known after apply)
      + metadata                  = {
          + "serial-port-enable" = "1"
          + "ssh-keys"           = "wahha:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDRadQXfkS3Ixj3cV7mcgvthZ21Rplwfimj9f+q9ZUP3nBRRerROB68BLvfpVO22FO7TvI2p8wtEZxy1zW6c05cAc28r0fUHAeIduNjI1yfsb/B6Mws/upS5MeSBcKhMBqK5mbH5DrerFIvsg8F5sYeAfLUBwxuCal1qX9c3ow56anLgRMR82wdRpEFQTuuPyMcU858WrsAZzA70jtn0cLm/kdbUr4mSW1LGouXz6DFLlUUIMuK80d2nwFG59DcRe5lN6/4Yr8AwOxhiVLRRM2Aha0ZWfqaW/7o0JXWxvPPnzICAq6Y1E8RUIhzKx7D1vyf/kUqeD6Wi9zJiH12eBL9VGPy9aL3WBoGDyDBXS4z/Gzr6EqmBu5LSvMnrC9A0yl0R6RLMdFRuIt/JfMv6ORboZleivwjfXnPF+v1sydrZC9ahr1kGQvfWMTqjPFI70YtfUiG5FAfu/hdwDXP3mrAulP95PsTaCCcQkHzjlpHzwYZgRG3a9drOPUSbJlTILM2navpRiBXsYURgbZJr9RekapFo/24puCTP38e30WdsDy5C7Qet3+JIXkNVLd8uELDw+3iU9UPkgDB6BkfHX7vjATr+0ZjsuMp+/SMOuMh+a8X8Q1WFzQPbeel39hoQHz5sUwa6e359nsHmcihpSptVsgTeeVj5XIG6bjvY6nyQw== wahha@mail.ru"
        }
      + name                      = "test-vm"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v3"
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd89nl7rpq3plgh1dmtu"
              + name        = (known after apply)
              + size        = 20
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options (known after apply)

      + network_interface {
          + index          = (known after apply)
          + ip_address     = (known after apply)
          + ipv4           = true
          + ipv6           = (known after apply)
          + ipv6_address   = (known after apply)
          + mac_address    = (known after apply)
          + nat            = true
          + nat_ip_address = (known after apply)
          + nat_ip_version = (known after apply)
          + subnet_id      = "e9bueub58rqnn9us6pbm"
        }

      + placement_policy (known after apply)

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 4
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
~ control_node_info = [
        {
            external_ip   = "158.160.110.213"
            fqdn          = "control-node-subnet-a.ru-central1.internal"
            instance_name = "control-node-subnet-a"
        },
      ~ {
          ~ external_ip   = "89.169.190.174" -> "158.160.9.9"
            # (2 unchanged attributes hidden)
        },
      ~ {
          ~ external_ip   = "84.201.169.11" -> "130.193.57.194"
            # (2 unchanged attributes hidden)
        },
    ]
~ worker_node_info  = [
      ~ {
          ~ external_ip   = "84.201.175.124" -> "158.160.36.66"
            # (2 unchanged attributes hidden)
        },
      ~ {
          ~ external_ip   = "158.160.6.237" -> "158.160.14.70"
            # (2 unchanged attributes hidden)
        },
    ]
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://51.250.77.76/lock?id=vakhtanov%252Fnetology-diploma-terraform-stage2%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```